#ifndef QUEUE_H_
#define QUEUE_H_

#include <stdbool.h>

#define MAXQUEUE 50

typedef unsigned short Item;

typedef struct node
{
	Item item;
	struct node *next;
} Node;

typedef struct queue
{
	Node *front;	//指向队列首的指针
	Node *rear;		//指向队列尾的指针
	unsigned short items;		//队列中项目的个数
} Queue;

/****************************************************************
*函数名称:	InitQueue
*函数功能:	初始化一个队列,将该队列初始化为空队列
*入口参数:	pQueue:	指向队列的指针
*返 回 值:	无
*****************************************************************/
void InitQueue(Queue *pQueue);

/****************************************************************
*函数名称:	QueueIsFull
*函数功能:	检查队列是否已满
*入口参数:	pQueue:	指向一个已初始化的队列
*返 回 值:	true:	队列已满
*			false:	队列未满
*****************************************************************/
bool QueueIsFull(const Queue *pQueue);

/****************************************************************
*函数名称:	QueueIsEmpty
*函数功能:	检查队列是否为空
*入口参数:	pQueue:	指向一个已初始化的队列
*返 回 值:	true:	队列为空
*			false:	队列不为空
*****************************************************************/
bool QueueIsEmpty(const Queue *pQueue);

/****************************************************************
*函数名称:	QueueItemCount
*函数功能:	确定队列中项目的个数
*入口参数:	pQueue:	指向一个已初始化的队列
*返 回 值:	队列中项目的个数
*****************************************************************/
int QueueItemCount(const Queue *pQueue);

/****************************************************************
*函数名称:	EnQueue
*函数功能:	向队列尾端添加项目
*入口参数:	item:	被添加的项目
*			pQueue:	指向一个已初始化的队列
*返 回 值:	true:	添加项目成功
*			false:	添加项目失败
*****************************************************************/
bool EnQueue(Item item, Queue *pQueue);

/****************************************************************
*函数名称:	DeQueue
*函数功能:	从队列首端删除项目,如果队列非空,队列首端项目被
*			复制到pitem,并被从队列中删除
*入口参数:	pQueue:	指向一个已初始化的队列
*返 回 值:	true:	添加项目成功
*			false:	添加项目失败
*****************************************************************/
bool DeQueue(Queue *pQueue);

/****************************************************************
*函数名称:	EmptyTheQueue
*函数功能:	清空队列
*入口参数:	pQueue:	指向一个已初始化的队列
*返 回 值:	无
*****************************************************************/
void EmptyTheQueue(Queue *pQueue);

#endif
